# Week 5b - Data Analytics for Engineers

*Monday 14th of February 2018*

## 1. Loc recap

In [1]:
import matplotlib.pyplot as plt 
import pandas as pd
%matplotlib inline

# import data
student_grades = pd.read_csv("http://bit.ly/dae_student_grades_predictors")

In [2]:
student_grades.head()

,student,assignment1,assignment2,homework,exam,resit,avg_grade_high_school,hours_spent_studying
0,Sem,6.7,7.5,9.5,7.8,NaN,7.9,45
1,Lucas,8.2,8.2,10.0,6.9,NaN,6.5,36
2,Tess,9.0,9.8,10.0,9.2,NaN,8.3,33
3,Adam,5.0,4.9,10.0,3.4,5.8,5.9,44
4,James,3.4,5.3,8.0,4.9,6.2,5.5,33

In [3]:
# if you scored a 10 for your homework than you get another bonus point (i.e. you get a theoretical score of 11)
student_grades.loc[student_grades['homework'] == 10].head()

,student,assignment1,assignment2,homework,exam,resit,avg_grade_high_school,hours_spent_studying
1,Lucas,8.2,8.2,10.0,6.9,NaN,6.5,36
2,Tess,9.0,9.8,10.0,9.2,NaN,8.3,33
3,Adam,5.0,4.9,10.0,3.4,5.8,5.9,44
5,Max,4.5,4.4,10.0,5.6,NaN,6.9,65
6,Fleur,7.0,8.6,10.0,5.9,NaN,6.1,18

In [4]:
# only select homework column
student_grades.loc[student_grades['homework'] == 10, 'homework']

1     10.0
2     10.0
3     10.0
5     10.0
6     10.0
7     10.0
8     10.0
11    10.0
12    10.0
14    10.0
15    10.0
18    10.0
19    10.0
Name: homework, dtype: float64

In [5]:
# assign value of 11
student_grades.loc[student_grades['homework'] == 10, 'homework'] = 11
# why do we need to define homework a second time?

## 2. NaNs

In [6]:
# check for NaNs (nulls)
student_grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
student                  20 non-null object
assignment1              20 non-null float64
assignment2              20 non-null float64
homework                 20 non-null float64
exam                     20 non-null float64
resit                    5 non-null float64
avg_grade_high_school    20 non-null float64
hours_spent_studying     20 non-null int64
dtypes: float64(6), int64(1), object(1)
memory usage: 1.3+ KB

In [7]:
# filter for NaNs
student_grades.head()

,student,assignment1,assignment2,homework,exam,resit,avg_grade_high_school,hours_spent_studying
0,Sem,6.7,7.5,9.5,7.8,NaN,7.9,45
1,Lucas,8.2,8.2,11.0,6.9,NaN,6.5,36
2,Tess,9.0,9.8,11.0,9.2,NaN,8.3,33
3,Adam,5.0,4.9,11.0,3.4,5.8,5.9,44
4,James,3.4,5.3,8.0,4.9,6.2,5.5,33

In [17]:
student_grades.loc[student_grades['resit'].isnull()]

Empty DataFrame
Columns: [student, assignment1, assignment2, homework, exam, resit, avg_grade_high_school, hours_spent_studying]
Index: []

In [9]:
# replace with empty string
student_grades.loc[student_grades['resit'].isnull(), "resit"] = ""
# what happens if we run the previous cell again?

## 3. Trailing White Spaces

In [10]:
name = pd.Series(['Sander Boersma', 'Lotte van Hochstenbach', 'Pieter van der Born ', 'Sander Boersma', 'Sander Boersma']) 
age = pd.Series([20, 20, 19, 20, 19])
df_age = pd.DataFrame({"name": name, "age": age})
df_age
# are there trailing white spaces? what are trailing white spaces actually?

   age                    name
0   20          Sander Boersma
1   20  Lotte van Hochstenbach
2   19    Pieter van der Born
3   20          Sander Boersma
4   19          Sander Boersma

In [11]:
df_age.iloc[2, 1]
# why should you remove trailing white spaces?

'Pieter van der Born '

In [19]:
df_age.iloc[2, 1].strip()
# is the trailing white space now removed?

'Pieter van der Born'

In [13]:
# no! you have to assign it to the specific record to overwrite the value
df_age.iloc[2, 1] = df_age.iloc[2, 1].strip()

In [14]:
# for all rows in the name column
df_age['name'] = df_age.loc[:, 'name'].str.strip()

## 4. Duplicates

In [15]:
df_age.drop_duplicates()
# why is Sander Boersma still two times in there?

   age                    name
0   20          Sander Boersma
1   20  Lotte van Hochstenbach
2   19     Pieter van der Born
4   19          Sander Boersma

## 5. Additional SQL Exercises (GA2 - Movies)

1. Determine the movie titles with the highest profit by genre of which the movie language was not French, German or Spanish.
2. Which column in the movies table has the most None / NaNs / Null values?
3. On which weekday (Monday - Sunday) is the gross revenue for English Action movies released in 2009 lowest?

## Where can I find these Jupyter Notebooks? 
https://github.com/RoyKlaasseBos/Data-Analytics-for-Engineers

## What am I supposed to do now?

In [20]:
# 1. Programming Exercises DAS
# 2. Theory Exercises DAS
# 3. Graded Assignment 2 (module 4/5)
# 4. Watch Video Lecture DAS